#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.this: Refreshing state... [id=vpc-06df2cc9df903fcc6]
data.aws_ami.ubuntu: Reading...
aws_subnet.this["pub_b"]: Refreshing state... [id=subnet-0bdf6ddd56da2b1ed]
aws_subnet.this["pvt_a"]: Refreshing state... [id=subnet-06d96f236868b790f]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:targetgroup/LB-TG/aaecb7a7f8475f95]
aws_subnet.this["pub_a"]: Refreshing state... [id=subnet-0d092a9a14b589095]
aws_internet_gateway.this: Refreshing state... [id=igw-05b4a7cf02a48404b]
aws_route_table.private: Refreshing state... [id=rtb-0295fb19985f8eb0b]
aws_security_group.lb: Refreshing state... [id=sg-037b90281f52abe57]
aws_subnet.this["pvt_b"]: Refreshing state... [id=subnet-0d516a0aaf968bf38]
aws_route_table.public: Refreshing state... [id=rtb-0fc0b88897e417bf7]
aws_security_group.autoscaling: Refreshing state... [id=sg-0215fd45a294a6139]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:loadbalancer/app/terraform-lb/07bf5e1378873bb0]
aws_security_group.web: Refreshing state... [id=sg-0f064d81dbde1886a]
aws_route_table_association.this["Public B"]: Refreshing state... [id=rtbassoc-003dde1084be03e03]
aws_route_table_association.this["Private B"]: Refreshing state... [id=rtbassoc-059505839012e14c4]
aws_route_table_association.this["Private A"]: Refreshing state... [id=rtbassoc-091e916326cbad7cd]
aws_route_table_association.this["Public A"]: Refreshing state... [id=rtbassoc-0627b3903173fa941]
aws_security_group.db: Refreshing state... [id=sg-0745ae104adc22303]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:listener/app/terraform-lb/07bf5e1378873bb0/db08ad376b73244d]
data.aws_ami.ubuntu: Read complete after 6s [id=ami-0b98832e47b2f19c8]
aws_launch_template.this: Refreshing state... [id=lt-06f25d61bdae6af8e]
aws_autoscaling_group.this: Refreshing state... [id=terraform-autoscaling]
aws_autoscaling_policy.scaledown: Refreshing state... [id=Scale Down]
aws_autoscaling_policy.scaleup: Refreshing state... [id=Scale Up]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.down will be created
  + resource "aws_cloudwatch_metric_alarm" "down" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:autoscaling:us-east-1:428654095624:scalingPolicy:a0b0741c-b632-4289-abff-f936a2822e4c:autoScalingGroupName/terraform-autoscaling:policyName/Scale Down",
        ]
      + alarm_description                     = "Scales down an instance when CPU utilization is lesser than 40%"
      + alarm_name                            = "ASG Down"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "terraform-autoscaling"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 40
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.up will be created
  + resource "aws_cloudwatch_metric_alarm" "up" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:autoscaling:us-east-1:428654095624:scalingPolicy:1272123c-043e-458b-9b8a-dfb8517a25e2:autoScalingGroupName/terraform-autoscaling:policyName/Scale Up",
        ]
      + alarm_description                     = "Scales up an instance when CPU utilization is greater than 30%"
      + alarm_name                            = "ASG Up"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "terraform-autoscaling"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 30
      + treat_missing_data                    = "missing"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @vanessafso, Action: `pull_request`*